In [1]:
# NIM/Nama  : 16521115/Fawwaz Abrial Saffa
# Tanggal   : 29 November 2021

In [2]:
import pandas as pd
data = pd.read_csv('H05.csv')

In [9]:
# 1. Nilai matematika. fisika, dan kimia milik Tuan Ric
data.loc[data['nama'] == 'Tuan Ric']

          nama fakultas  nilai_mat  nilai_kim  nilai_fis
3513  Tuan Ric     STEI      96.78      62.23      30.53

In [11]:
# 2. Mahasiswa dengan nilai fisika tertinggi.
data[data['nilai_fis'].max() == data['nilai_fis']]

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
1936  Yuniar Fazriani Rusmana     FITB      53.61      67.19      92.57

In [12]:
# 3. 10 Mahasiswa dengan nilai kimia tertinggi
data.sort_values('nilai_kim', ascending=False)[0:10]

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
2554      Faathir Reza Avicena     FTSL      57.12      81.50      78.68
2779      Dinda A A Z Mundakir     STEI      41.18      81.34      82.60
3544        Tammya Ayu Purnomo    SITHS      74.49      81.20      78.58
4934    Alyssa Nadhira Windari     FTMD      78.38      78.83      78.68
1137          Izni Nur Ibrahim     STEI      56.70      78.46      84.34
2262      Rinaldi Oky Setiawan     STEI      71.22      77.44      83.66
4070      Ias Azhari Rezkyarno    FMIPA      62.85      76.90      81.52
2945           Klara Petra T T     FTSL      73.39      76.61      78.12
1788  Naudy Germanimo Laksmana     FTMD      62.29      76.38      76.15
1310       Mardliyahtur Rohmah     STEI      63.15      76.36      74.06

In [16]:
# 4. Banyaknya nilai matematika di bawah 50.
len(data[data['nilai_mat'] < 50])

329

In [17]:
# 5. Banyaknya mahasiswa FMIPA.
data['fakultas'].value_counts()['FMIPA']

627